In [2]:
import pandas as pd

In [92]:
from __future__ import division

In [16]:
data = pd.read_csv('adult_data.csv')
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [ ]:
# смотрим типы данных

In [18]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours-per-week    32561 non-null int64
native-country    32561 non-null object
salary            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB
None

In [ ]:
# задание 1 - Сколько мужчин и женщин (признак sex) представлено в этом наборе данных?

In [19]:
data['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [ ]:
# задание 2 - Каков средний возраст (признак age) женщин?

In [21]:
data[data['sex'] == 'Female']['age'].mean()

36.85823043357163

In [ ]:
# задание 3 - Какова доля граждан Германии (признак native-country)?

In [165]:
count = len(data)

In [166]:
print(count)

32561

In [85]:
count_Germany = data[data['native-country'] == 'Germany'].shape[0]

In [86]:
print(count_Germany)

137

In [98]:
result = (count_Germany/count)

In [99]:
print(result)

0.00420748748503

In [100]:
result1 = result*100

In [101]:
print(result1)

0.420748748503

In [ ]:
# задание 4-5 - Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак salary) и тех, кто получает менее 50K в год?

In [96]:
data[data['salary'] == '>50K']['age'].mean()

44.24984058155847

In [97]:
data[data['salary'] == '<=50K']['age'].mean()

36.78373786407767

In [103]:
data[data['salary'] == '>50K']['age'].describe()

count    7841.000000
mean       44.249841
std        10.519028
min        19.000000
25%        36.000000
50%        44.000000
75%        51.000000
max        90.000000
Name: age, dtype: float64

In [104]:
data[data['salary'] == '<=50K']['age'].describe()

count    24720.000000
mean        36.783738
std         14.020088
min         17.000000
25%         25.000000
50%         34.000000
75%         46.000000
max         90.000000
Name: age, dtype: float64

In [ ]:
# задание 6 -  Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate)

In [130]:
data[(data['salary'] == '>50K')].groupby(['education'])['education', 'salary'].describe()

             education                            salary
                 count unique           top  freq  count unique   top  freq
education
10th                62      1          10th    62     62      1  >50K    62
11th                60      1          11th    60     60      1  >50K    60
12th                33      1          12th    33     33      1  >50K    33
1st-4th              6      1       1st-4th     6      6      1  >50K     6
5th-6th             16      1       5th-6th    16     16      1  >50K    16
7th-8th             40      1       7th-8th    40     40      1  >50K    40
9th                 27      1           9th    27     27      1  >50K    27
Assoc-acdm         265      1    Assoc-acdm   265    265      1  >50K   265
Assoc-voc          361      1     Assoc-voc   361    361      1  >50K   361
Bachelors         2221      1     Bachelors  2221   2221      1  >50K  2221
Doctorate          306      1     Doctorate   306    306      1  >50K   306
HS-grad           1675      1       HS-grad  1675   1675      1  >50K  1675
Masters            959      1       Masters   959    959      1  >50K   959
Prof-school        423      1   Prof-school   423    423      1  >50K   423
Some-college      1387      1  Some-college  1387   1387      1  >50K  1387

In [ ]:
# задание 7 -  Выведите статистику возраста для каждой расы (признак race) и каждого пола. Используйте groupby и describe. Найдите таким образом максимальный возраст мужчин расы Amer-Indian-Eskimo.

In [131]:
data[(data['race']=='Amer-Indian-Eskimo') & (data['sex'] == 'Male')].groupby(['race'])['age'].describe()[['max']]

                     max
race
Amer-Indian-Eskimo  82.0

In [ ]:
# задание 8 - Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак marital-status)? Женатыми считаем тех, у кого marital-status начинается с Married (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.

In [149]:
married = data[(data['salary'] == '>50K') & ((data['marital-status'] == 'Married-civ-spouse') | (data['marital-status'] == 'Married-spouse-absent') | (data['marital-status'] == 'Married-AF-spouse'))].groupby(['marital-status'])['salary'].count()

In [150]:
print(married)

marital-status
Married-AF-spouse          10
Married-civ-spouse       6692
Married-spouse-absent      34
Name: salary, dtype: int64

In [163]:
married.sum()

6736

In [161]:
not_married = data[(data['salary'] == '>50K') & ((data['marital-status'] != 'Married-civ-spouse') & (data['marital-status'] != 'Married-spouse-absent') & (data['marital-status'] != 'Married-AF-spouse'))].groupby(['marital-status'])['salary'].count()

In [162]:
print(not_married)

marital-status
Divorced         463
Never-married    491
Separated         66
Widowed           85
Name: salary, dtype: int64

In [164]:
not_married.sum()

1105

In [ ]:
# задание 9 - Какое максимальное число часов человек работает в неделю (признак hours-per-week)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?

In [135]:
data['hours-per-week'].max()

99

In [140]:
counted = data[(data['hours-per-week'] == data['hours-per-week'].max())]['age'].count()

In [ ]:
print(counted)

In [141]:
h_salary = data[(data['hours-per-week'] == data['hours-per-week'].max()) & (data['salary'] == '>50K')]['age'].count()

In [142]:
print(h_salary)

25

In [143]:
h_salary/counted*100

29.411764705882355

In [ ]:
# задание 10 - Посчитайте среднее время работы (hours-per-week) зарабатывающих мало и много (salary) для каждой страны (native-country).

In [144]:
data.groupby(['salary', 'native-country'])['hours-per-week'].mean()

salary  native-country
<=50K   ?                             40.164760
        Cambodia                      41.416667
        Canada                        37.914634
        China                         37.381818
        Columbia                      38.684211
        Cuba                          37.985714
        Dominican-Republic            42.338235
        Ecuador                       38.041667
        El-Salvador                   36.030928
        England                       40.483333
        France                        41.058824
        Germany                       39.139785
        Greece                        41.809524
        Guatemala                     39.360656
        Haiti                         36.325000
        Holand-Netherlands            40.000000
        Honduras                      34.333333
        Hong                          39.142857
        Hungary                       31.300000
        India                         38.233333
        Iran                          41.440000
        Ireland                       40.947368
        Italy                         39.625000
        Jamaica                       38.239437
        Japan                         41.000000
        Laos                          40.375000
        Mexico                        40.003279
        Nicaragua                     36.093750
        Outlying-US(Guam-USVI-etc)    41.857143
        Peru                          35.068966
                                        ...
>50K    France                        50.750000
        Germany                       44.977273
        Greece                        50.625000
        Guatemala                     36.666667
        Haiti                         42.750000
        Honduras                      60.000000
        Hong                          45.000000
        Hungary                       50.000000
        India                         46.475000
        Iran                          47.500000
        Ireland                       48.000000
        Italy                         45.400000
        Jamaica                       41.100000
        Japan                         47.958333
        Laos                          40.000000
        Mexico                        46.575758
        Nicaragua                     37.500000
        Peru                          40.000000
        Philippines                   43.032787
        Poland                        39.000000
        Portugal                      41.500000
        Puerto-Rico                   39.416667
        Scotland                      46.666667
        South                         51.437500
        Taiwan                        46.800000
        Thailand                      58.333333
        Trinadad&Tobago               40.000000
        United-States                 45.505369
        Vietnam                       39.200000
        Yugoslavia                    49.500000
Name: hours-per-week, Length: 82, dtype: float64